# Importer IFC Methods

Source: https://www.revitapidocs.com/2026/eed01aca-b82c-2019-c264-67677b7ec8f3.htm

---

| Importer IFC Methods |
| --- |

The ImporterIFC type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetOptions | Gets the collection of named options set by the importer client. |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ProcessIFCProject(IFCAnyHandle) | The entry point to the native IFC import function. Processes the main IfcProject and creates appropriate Revit elements. |
|  | ProcessIFCProject(IFCAnyHandle, IDictionary IFCAnyHandle, ElementId ) |  |
|  | SetFile | Sets the handle to the IFC file being created during this import operation. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

ImporterIFC Class Autodesk.Revit.DB.IFC Namespace